import React from 'react'


import mgmIcon from '../../assets/img/mgm.png'
import oscarIcon from '../../assets/img/oscar.png'
import './AboutMetroGoldwynMaer.scss'

const AboutMetroGoldwynMaer = () => {
    return (
        <div className="mgm">
            <img className="mgm--logo" src={mgmIcon} alt="metro goldwyn maer"/>
            <h1>Metro Goldwyn Maer</h1>
            <div className="mgm__box">
                <div className="mgm__box__text">
                <img className="mgm--oscar" src={oscarIcon} alt="oscar"/>
                <p>Компания «Metro-Goldwyn-Mayer» была основана в апреле 1924 года владельцем крупной сети кинотеатров, Маркусом Ловом, организовавшим слияние трёх кинопроизводителей — «Metro Pictures», «Goldwyn Pictures» С. Голдвина и «Louis B. Mayer Pictures» Л. Б. Майера. Поскольку Николас Шенк, компаньон Лова, был занят обустройством кинотеатров на восточном побережье, в качестве заведующего кинопроизводством в Калифорнии был назначен Л. Б. Майер (в ранге вице-президента).</p>
                <p>Логотипом новой компании стал рычащий лев студии Голдвина, впервые появившийся на киноэкранах в 1916 году. У той же студии был позаимствован девиз «Искусство ради искусства». С 1932 г. рекламная стратегия компании базировалась на утверждении, что в её фильмах «больше звёзд, чем на небе».</p>
                <p>Первой задачей Майера было завершение съёмок самого крупнобюджетного фильма в истории немого кино, «Бен-Гур: история Христа»; этот проект достался ему в наследство от студии Голдвина. Триумф этого фильма позволил MGM обойти Universal Studios в качестве крупнейшей по выручке студии США. Звание «локомотива Голливуда» и первое место в «большой пятёрке» кинопроизводителей MGM сохранит на протяжении последующих 30 лет.</p>
                <p>Одним из самых успешных подразделений MGM (до закрытия в 1957 году) было мультипликационное, где в 1940-е годы работали художники-мультипликаторы Текс Эйвери (Red Hot Riding Hood, Swing Shift Cinderella, фильмы про собаку Друпи), дуэт Харман-Айзинг (фильмы про медвежонка Барни) и дуэт Ханна-Барбера (мультфильмы про Тома и Джерри, из которых 7 были удостоены «Оскара»).</p>
                <p>История этого подразделения началась в 1930 году, когда Майер заказал знаменитому Абу Айверксу создание мультперсонажа для первых мультфильмов в текниколоре. Так появился лягушонок Флип, к которому вскоре присоединился Вилли Вуппер. Эти творения Айверкса не имели большого успеха у публики. В 1934 году Майеру удалось переманить от Леона Шлезингера на MGM мультипликаторов Хармана и Айзинга, создателей персонажа Боско, который появлялся в Looney Tunes. По аналогии со шлезингеровским циклом Merrie Melodies был запущен собственный проект для детей — Happy Harmonies.</p>
                </div>
                 
                
            </div>
        </div>
    )
}

export default AboutMetroGoldwynMaer
